var flow = {
  id: 1,
  name: '年终考核',
  desc: '2020年度人员考核定级及评优工作',
  icon: 'gongzuobaogao',
  def: {
    name: {
      label: "姓名",
      control: 'input',
      option: {
        required: true
      }
    },
    dep: {
      label: "部门",
      control: 'select',
      option: {
        options: ['装修事业部', '建设管理事业部', '房建监理事业部', '市政监理事业部'],
        defaultValue: 0,
        required: true,
      }
    },
    position: {
      label: "职务",
      control: 'select',
      option: {
        options: ['项目总监', '监理工程师', '监理员', '行政'],
        required: true,
        defaultValue: 2
      }
    },
    rank: {
      label: "职称",
      control: 'input'
    },

    report: {
      control: "docx",
      label: "述职报告",
      option: {
        single: true,
        list: true
      }
    },

    self_ev0: {
      label: "考核自评(项目总监/项目经理)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
          2、“ 分析判断能力” 指面对突发、 复杂、 系统性问题的分析和解决能力。
          3、“ 实际效果” 指项目客观上质量、 安全实际情况及业主单位评价。
          4、“ 团队建设” 含员工培养、 内部管理、 内部氛围等。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习创新能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "分析判断能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "控制力度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "实际效果",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "配合公司情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    self_ev1: {
      label: "考核自评(工程师级)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。

`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "内业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "外业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习与创新",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作指导能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    self_ev2: {
      label: "考核自评(员级/监理员)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“知识与技能”各分项需按成熟监理员要求，权衡评分。
3、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
4、	“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "专业基础知识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "施工工艺经验",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "仪器操作技能",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "资料整理能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协作态度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习发展潜力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    self_ev3: {
      label: "考核自评(行政)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、 “优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "服务意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "协作意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作质量",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作效率",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持项目情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持部门情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro2_ev0: {
      label: "考核打分(项目总监/项目经理)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
          2、“ 分析判断能力” 指面对突发、 复杂、 系统性问题的分析和解决能力。
          3、“ 实际效果” 指项目客观上质量、 安全实际情况及业主单位评价。
          4、“ 团队建设” 含员工培养、 内部管理、 内部氛围等。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习创新能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "分析判断能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "控制力度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "实际效果",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "配合公司情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro_ev1: {
      label: "考核打分(工程师级)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。

`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "内业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "外业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习与创新",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作指导能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro_ev2: {
      label: "考核打分(员级/监理员)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“知识与技能”各分项需按成熟监理员要求，权衡评分。
3、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
4、	“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "专业基础知识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "施工工艺经验",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "仪器操作技能",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "资料整理能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协作态度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习发展潜力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro_ev3: {
      label: "考核打分(行政)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、 “优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "服务意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "协作意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作质量",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作效率",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持项目情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持部门情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro_ev0: {
      label: "考核打分(项目总监/项目经理)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
          2、“ 分析判断能力” 指面对突发、 复杂、 系统性问题的分析和解决能力。
          3、“ 实际效果” 指项目客观上质量、 安全实际情况及业主单位评价。
          4、“ 团队建设” 含员工培养、 内部管理、 内部氛围等。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习创新能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "分析判断能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "控制力度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "实际效果",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "配合公司情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro2_ev1: {
      label: "考核打分(工程师级)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。

`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "内业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "外业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习与创新",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作指导能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro2_ev2: {
      label: "考核打分(员级/监理员)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“知识与技能”各分项需按成熟监理员要求，权衡评分。
3、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
4、	“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "专业基础知识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "施工工艺经验",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "仪器操作技能",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "资料整理能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协作态度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习发展潜力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    pro2_ev3: {
      label: "考核打分(行政)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、 “优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "服务意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "协作意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作质量",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作效率",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持项目情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持部门情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    dep_ev0: {
      label: "考核打分(项目总监/项目经理)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
          2、“ 分析判断能力” 指面对突发、 复杂、 系统性问题的分析和解决能力。
          3、“ 实际效果” 指项目客观上质量、 安全实际情况及业主单位评价。
          4、“ 团队建设” 含员工培养、 内部管理、 内部氛围等。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习创新能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "分析判断能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "控制力度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "实际效果",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "配合公司情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    dep_ev1: {
      label: "考核打分(工程师级)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。

`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "内业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "外业能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习与创新",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协调能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作指导能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "团队建设情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    dep_ev2: {
      label: "考核打分(员级/监理员)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、“知识与技能”各分项需按成熟监理员要求，权衡评分。
3、“优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
4、	“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "专业基础知识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "施工工艺经验",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "仪器操作技能",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "资料整理能力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "精细严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "沟通协作态度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "学习发展潜力",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    dep_ev3: {
      label: "考核打分(行政)",
      control: "questionairy",
      option: {
        desc: `1、凡遇有职业道德违规事项，必须随时逐级上报，个案处理。
2、 “优秀”等级合计得分不宜低于85分，分项得分不宜低于80%，推荐比例一般不应超过25%。
3、“勤奋敬业精神”（包含工作纪律）分项得分60%以下者，按“不称职”推荐等级。
`,
        questions: [{
          title: "职业道德",
          desc: "实行一票否决制，凡存在问题，考核结论即为不称职",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "服务意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "协作意识",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "严谨程度",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作质量",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "工作效率",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "勤奋敬业精神",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持项目情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }, {
          title: "支持部门情况",
          options: ['5分及以下', '6分', '6.5分', '7分', '7.5分', '8分', '8.5分', '9分', '9.5分', '10分']
        }]
      }
    },
    self_qn0: {
      label: "调查问卷(员工)",
      control: "questionairy",
      option: {
        questions: [{
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }, {
          title: "能力提升",
          desc: "描述",
          options: ['非常大', '很大', '大', '比较大', '不大', '几乎没有']
        }, {
          title: "环境适应度",
          desc: "发展潜力",
          options: ['非常舒适', '很舒适', '舒适', '还算舒适', '适应', '还算适应', '不太适应']
        }]
      }
    },
    self_qn1: {
      label: "调查问卷(总监/项目经理)",
      control: "questionairy",
      option: {
        questions: [{
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }, {
          title: "团队建设",
          desc: "描述",
          options: ['非常好', '很好', '好', '比较好', '正常', '一般般', '不大好']
        }, {
          title: "业主关系",
          desc: "发展潜力",
          options: ['非常认可', '很认可', '认可', '比较认可', '正常', '一般般', '不大认可']
        }, {
          title: "目标达成",
          desc: "描述",
          options: ['完全实现', '大多数实现', '重点实现', '基本实现', '有点差距', '差距很大']
        }]
      }
    },
    score: {
      label: "总监/项目经理考核打分(员工)",
      control: "questionairy",
      option: {
        questions: [{
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }, {
          title: "能力提升",
          desc: "描述",
          options: ['非常大', '很大', '大', '比较大', '正常', '不大', '几乎没有']
        }, {
          title: "成长性",
          desc: "发展潜力",
          options: ['潜力非常大', '潜力很大', '潜力大', '潜力较大', '潜力一般', '潜力不大', '没啥潜力']
        }, {
          title: "岗位等级",
          desc: "描述",
          options: ['见习', '初级助理', '助理', '成熟助理', '初级/偏弱工程师', '工程师', '成熟工程师', '优秀工程师']
        }, {
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }]
      }
    },
    finalscore0: {
      label: "事业部考核打分(员工)",
      control: "questionairy",
      option: {
        questions: [{
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }, {
          title: "团队建设",
          desc: "描述",
          options: ['非常好', '很好', '好', '比较好', '正常', '一般般', '不大好']
        }, {
          title: "业主关系",
          desc: "发展潜力",
          options: ['非常认可', '很认可', '认可', '比较认可', '正常', '一般般', '不大认可']
        }, {
          title: "目标达成",
          desc: "描述",
          options: ['完全实现', '大多数实现', '重点实现', '基本实现', '有点差距', '差距很大']
        }]
      }
    },
    finalscore1: {
      label: "事业部考核打分(总监/项目经理)",
      control: "questionairy",
      option: {
        questions: [{
          title: "工作饱满度",
          desc: "描述",
          options: ['非常饱满', '很饱满', '饱满', '有点饱满', '正常', '偏少', '很少']
        }, {
          title: "团队建设",
          desc: "描述",
          options: ['非常好', '很好', '好', '比较好', '正常', '一般般', '不大好']
        }, {
          title: "业主关系",
          desc: "发展潜力",
          options: ['非常认可', '很认可', '认可', '比较认可', '正常', '一般般', '不大认可']
        }, {
          title: "目标达成",
          desc: "描述",
          options: ['完全实现', '大多数实现', '重点实现', '基本实现', '有点差距', '差距很大']
        }]
      }
    }

  },
  nodes: {
    n1: {
      name: "员工自评",
      desc: "员工自行填写《员工考核表》进行自评打分并上传年度述职报告，选择相关的打分负责人",
      layout: ` <div>
      <div><h2 style='text-align:center;font-family:仿宋;font-size:20px;font-weight:bold;'>员工自评表</h2>
      <Row :gutter='12' style='margin-top:30px'><Col :span='6'>{{name}}</Col><Col :span='6'>{{dep}}</Col><Col :span='6'>{{position}}</Col><Col :span='6'>{{rank}}</Col></Row>
    
      <div style='margin:20px 0'>{{executors}}</div>
      
      <div style='margin-top:10px' v-if="db.model.position==0">{{self_ev0}}</div><div style='margin-top:10px' v-if="db.model.position==1">{{self_ev1}}</div><div style='margin-top:10px' v-if="db.model.position==2">{{self_ev2}}</div><div style='margin-top:10px' v-if="db.model.position==3">{{self_ev3}}</div><div style='margin-top:10px' v-if="db.model.position>0">{{self_qn0}}</div><div style='margin-top:10px' v-if="db.model.position==0">{{self_qn1}}</div>
      </div></div>`,
      view: `<div><h2 style='text-align:center;font-family:仿宋;font-size:20px;font-weight:bold;'>述职报告</h2><div style='margin-top:20px'>{{report}}</div></div>`
    },
    n2: {
      name: "第一负责人打分(项目部/部门)",
      desc: "由项目部/部门负责人对员工进行打分",
      layout: `
      <div>{{db}}<h2 style='text-align:center;font-family:仿宋;font-size:20px;font-weight:bold;'>项目部打分评价表</h2><Row :gutter='12' style='margin-top:30px'><Col :span='6'>{{db.model.name}}</Col><Col :span='6'>{{db.model.dep}}</Col><Col :span='6'>{{db.model.position}}</Col><Col :span='6'>{{db.model.rank}}</Col></Row>
      <div style='margin-top:10px' v-if="db.model.position==0">{{pro_ev0}}</div><div style='margin-top:10px' v-if="db.model.position==1">{{pro_ev1}}</div><div style='margin-top:10px' v-if="db.model.position==2">{{pro_ev2}}</div><div style='margin-top:10px' v-if="db.model.position==3">{{pro_ev3}}</div><div style='margin-top:10px' v-if="db.model.position>0">{{score}}</div><div style='margin-top:10px' v-if="db.model.position==0">{{finalscore1}}</div>
      </div>`,
      view: `<div><div v-html='model.report'></div></div>`,
      executor: "{PROJECT_MANAGER}"
    },
    n3: {
      name: "平行负责人打分",
      desc: "由员工选定的其他负责人进行打分，结果不计入考核，仅作为参考",
      executor: ""
    },
    n4: {
      name: "第二负责人打分(事业部)",
      desc: "由所属事业部负责人对员工进行评分",
      executor: "{DEP_MANAGER}"
    },
    n5: {
      name: "结果汇总",
      desc: "最终结果发送至行政部进行汇总",
      executor: ["詹红岩"]
    }
  },
  actions: {
    a1: {
      name: "发送",
      from: "n1",
      to: "n2",
      type: "submit"
    },
    a2: {
      name: "发送",
      from: "n1",
      to: "n3",
      type: "submit"
    },
    a3: {
      name: "退回",
      from: "n2",
      to: "n1",
      type: "reject"
    },
    a4: {
      name: "发送",
      from: "n2",
      to: "n4",
      type: "submit"
    },
    a5: {
      name: "提交",
      from: "n3",

      type: "submit"
    },
    a6: {
      name: "退回",
      from: "n4",
      to: "n2",
      type: "reject"
    },
    a7: {
      name: "发送",
      from: "n4",
      to: "n5",
      type: "submit"
    },
    a8: {
      name: "接收",
      from: "n5",
      to: "finished",
      type: "accept"
    },
    a9: {
      name: "退回",
      from: "n5",
      to: "n4",
      type: "reject"
    }
  },
}




module.exports = flow